{
  "title": "Matt Finucane - Meteor Contentful",
  "description": "An Open-source package to leverage content management in MeteorJS applications.",
  "slug": "projects/meteor-contentful",
  "root": {
    "content": [
      {
        "tagName": "section",
        "content": [
          {
            "tagName": "h1",
            "content": "Meteor Contentful"
          },
          {
            "tagName": "h2",
            "content": "An Open-source package to leverage content management in MeteorJS applications."
          }
        ]
      },
      {
        "tagName": "section",
        "content": [
          {
            "tagName": "p",
            "content": "I built this package so I could synchronise content from Contentful to a collection of brochureware sites I was working on. [Contentful](https://www.contentful.com) is a web based service that provides content management. They offer a REST api and webhooks to make content updates seamless."
          },
          {
            "tagName": "p",
            "content": "I wanted to create this module to allow non-technical users to manage the content on their sites, and I chose Contentful fo the following reasons:"
          }
        ]
      },
      {
        "tagName": "ul",
        "content": [
          {
            "tagName": "li",
            "content": "The user experience was good, with a nice neat interface that was easy to use for a non technical person."
          },
          {
            "tagName": "li",
            "content": "They had impressive image asset management capabilities alongside a well documneted REST API service."
          },
          {
            "tagName": "li",
            "content": "Markdown was used for content editing, which is nice and clean. Content types could also be specified with strict type enforcement and checking, offering great flexibility."
          },
          {
            "tagName": "li",
            "content": "A webhook service was provided to push new changes, thus negating the need to build an automated sync tool. This package could (optionally) listen for changes and update content on the fly."
          }
        ]
      },
      {
        "tagName": "p",
        "content": "I used a handy tool called [ngrok.io](https://ngrok.com/) which acts as a secure tunnel to open your development machine to external services. Tests were run using a combination of Mocha, Chai and SinonJS."
      },
      {
        "tagName": "p",
        "content": "This package is no longer supported and has been archived, but the project can be seen on [GitGub](https://github.com/matfin/meteor-contentful)."
      }
    ]
  }
}
