{
  "title": "Matt Finucane - Me right now",
  "description": "This is where I am and what I'm doing right now.",
  "slug": "now",
  "contents": [
    {
      "tagName": "section",
      "id": "intro",
      "content": [
        {
          "tagName": "h1",
          "content": "Me right now"
        },
        {
          "tagName": "h2",
          "content": "This is where I am and where I want to go."
        }
      ]
    },
    {
      "tagName": "section",
      "id": "content",
      "content": [
        {
          "tagName": "p",
          "content": "I am currently working (remotely) as a senior frontend engineer for [TravelPort Digital](https://www.travelport.com \"TravelPort Digital\"), a Dublin-based company specialising in IT solutions for the corporate travel industry. I act as a consultant and build solutions to problems with a team made up of many disciplines including UX designers, product owners and other engineers."
        },
        {
          "tagName": "p",
          "content": "For the last three years, my primary focus has been on frontend development using ReactJS and the usual industry standard tools that come with it - [Jest](https://jestjs.io/ \"Jest\"), [webpack](https://webpack.js.org/ \"webpack\"), [TypeScript](https://www.typescriptlang.org/ \"TypeScript\") and [Babel](https://babeljs.io/ \"Babel\") - to name but a few. These are the tools I am most comfortable working with, but I am always open to trying out new things and experimenting. For instance, I have tested the components for this website with [React Testing Library](https://testing-library.com/docs/react-testing-library/intro \"Testing Library\")."
        },
        {
          "tagName": "p",
          "content": "I am a strong proponent of a remote-first or hybrid work policy, and I don’t believe it is necessary to have to go into an office five days of the week. Our World is changing right now, and we are already starting to see remote work become the norm."
        },
        {
          "tagName": "p",
          "content": "I think that governments around the World need to take the initiative and invest heavily in broadband infrastructure, so that it can be brought to more homes (especially in more remote areas). With that, we will see the return of skilled workers to these areas and thus, rejuvenation."
        },
        {
          "tagName": "p",
          "content": "I work best with well thought out, documented and supported frameworks and libraries. I love working with [ReactJS](https://reactjs.org/ \"ReactJS\"), and thoroughly enjoyed [Meteor](https://www.meteor.com/ \"Meteor\") and [PolymerJS](https://www.polymer-project.org/ \"Polymer Project\"). They adhere to the principles of testability, simplicity and re-usability and they have some very clever people working behind them."
        },
        {
          "tagName": "p",
          "content": "When I am not in front of the computer, I like taking photos, cycling, running and sitting in front of the computer experimenting with new things. My [GitHub profile](https://github.com/matfin \"matfin (Matt Finucane) on GitHub\") has a ton of my personal projects that I have worked on in my spare time. If you like photos, you can check out my [personal photography website](https://cinematt.photography \"Personal Photography Website\")."
        },
        {
          "tagName": "p",
          "content": "I am also somewhat active on [Twitter](https://twitter.com/matfinucane \"@matfinucane on Twitter\") but use it more for catching up on news and tech related discussion. You can also find me on [LinkedIn](https://www.linkedin.com/in/mattfinucane/ \"Matt Finucane on LinkedIn\")."
        }
      ]
    }
  ]
}
